#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
random_string.password: Refreshing state... [id=a]Q%6P!A1ws91BeqoO[pRpUY6-H%QCtC]
azuread_application.default: Refreshing state... [id=a265a4ff-4043-4828-b70f-4cb02aa098ce]
azuread_service_principal.default: Refreshing state... [id=05cd3ee5-0f0e-47a3-bf6f-990c94cd43e1]
azuread_service_principal_password.default: Refreshing state... [id=05cd3ee5-0f0e-47a3-bf6f-990c94cd43e1/password/3a965c14-cf28-497e-ab9d-63ace923e134]
azurerm_resource_group.default: Refreshing state... [id=/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev]
azurerm_role_assignment.aks_network: Refreshing state... [id=/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.Authorization/roleAssignments/5a276948-3131-70c0-b874-d208955e9b98]
azurerm_container_registry.default: Refreshing state... [id=/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.ContainerRegistry/registries/liatrioacrdev]
azurerm_role_assignment.aks_acr: Refreshing state... [id=/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.ContainerRegistry/registries/liatrioacrdev/providers/Microsoft.Authorization/roleAssignments/aac180c9-fb21-17be-d34f-4d3a802d3642]
azurerm_kubernetes_cluster.default: Refreshing state... [id=/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.ContainerService/managedClusters/liatrio-aks-dev]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_container_registry.default has been deleted
  - resource "azurerm_container_registry" "default" {
      - admin_enabled                 = false -> null
      - anonymous_pull_enabled        = false -> null
      - data_endpoint_enabled         = false -> null
      - encryption                    = [
          - {
              - enabled            = false
              - identity_client_id = ""
              - key_vault_key_id   = ""
            },
        ] -> null
      - georeplication_locations      = [] -> null
      - georeplications               = [] -> null
      - id                            = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.ContainerRegistry/registries/liatrioacrdev" -> null
      - location                      = "eastus2" -> null
      - login_server                  = "liatrioacrdev.azurecr.io" -> null
      - name                          = "liatrioacrdev" -> null
      - network_rule_bypass_option    = "AzureServices" -> null
      - network_rule_set              = [] -> null
      - public_network_access_enabled = true -> null
      - quarantine_policy_enabled     = false -> null
      - resource_group_name           = "liatrio-rg-dev" -> null
      - retention_policy              = [
          - {
              - days    = 7
              - enabled = false
            },
        ] -> null
      - sku                           = "Standard" -> null
      - trust_policy                  = [
          - {
              - enabled = false
            },
        ] -> null
      - zone_redundancy_enabled       = false -> null
    }

  # azurerm_kubernetes_cluster.default has been deleted
  - resource "azurerm_kubernetes_cluster" "default" {
      - automatic_channel_upgrade           = "" -> null
      - disk_encryption_set_id              = "" -> null
      - dns_prefix                          = "tfq-liatrio-aks-dev" -> null
      - dns_prefix_private_cluster          = "" -> null
      - enable_pod_security_policy          = false -> null
      - fqdn                                = "tfq-liatrio-aks-dev-9b79eecd.hcp.eastus2.azmk8s.io" -> null
      - id                                  = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.ContainerService/managedClusters/liatrio-aks-dev" -> null
      - kube_admin_config                   = [] -> null
      - kube_admin_config_raw               = (sensitive value)
      - kube_config                         = [
          - {
              - client_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUZIakNDQXdhZ0F3SUJBZ0lSQUxMa0o5OEFReHZ6NHR2WFlKR2pNRkV3RFFZSktvWklodmNOQVFFTEJRQXcKRFRFTE1Ba0dBMVVFQXhNQ1kyRXdIaGNOTWpJd01qRXhNRE0wTlRJeVdoY05NalF3TWpFeE1ETTFOVEl5V2pBdwpNUmN3RlFZRFZRUUtFdzV6ZVhOMFpXMDZiV0Z6ZEdWeWN6RVZNQk1HQTFVRUF4TU1iV0Z6ZEdWeVkyeHBaVzUwCk1JSUNJakFOQmdrcWhraUc5dzBCQVFFRkFBT0NBZzhBTUlJQ0NnS0NBZ0VBMzRUMnh0bUhoWGdSb1VtNmNUZ1kKTnZyUmZCWGpsMkdjcG0rTGFVTXhHWUFnRzBDNm9FdVFRbEZ0RWZaY0xtM0EzRXRKVlNBOHlrbkpZT1prdk1mVwpUTXV3TjhZNkdzb3E1ZDRwOGpnZytxeXNMMU5LQmVGOGw5VVR6eGFqa1JMMFF1UEJQUU13eGVZZEU3eGNIcUNVCm04eHNiUG0zQ25mZ3puWDFFOXhpZU9oMVlxT3hnbkpUV0lxKzRLYStjZVlUaU5pVzFWQUtRL0dvVXZRaXduSCsKaGJPYWgwWThQV0M0SnlPdmJjQkovSHU2amlDTTdYMW0xQUZRazg0a0IycHAvMnBBaWhFS1YydGpwUktZZ1RpZwo3VUg3QUlKdnRvaVlFcUQ5UEFNTm1LZUxERzZmYWFOWlhwL2drUnE3TzVvejJRYUdVc0w2aVErWGRHUDM2WFRtCnQyWVltZkxjQSsveTAyNlIzaVE5RGZMMFdydk52dFJJb0doOWNjYS9wbVlHUDA2U1NjWHhKanVsNE5NNHllWmQKOWUxNzUvc0V5SHltQnBFQ2hkcFVzczFWUEFHS3h5VHpDVTBkVC9sSjZZQTNlNE9DVzNvMG44RkM2OEE5N3ZjSgpEV0JhMzBPSXBLNGQwTlJFVkVFSW1VQXhsaWJIWmt3YUVTWTkrenVwSDJYOTdISGhvQlRaY3FmeWNSTGx5ODF4CnVFQm9zcm5WdUkwN2ovVTFnTkhKNGtEaS9ha01kYmt4UDJKdUJlQjMwWTRwUW5xQ1d2cm1WQWZ5cHNtaFJrUm8KWUdBL2djYm4xZHRaZlFXKzVHQWZuNkx4L3liV28vS1IxZmJMcWhxRnlQY1RFUEF3amc5T3JWbVk0K3RVckgyVAp2YitUTk5oWXYzNERvRUF1SXV1VklIMENBd0VBQWFOV01GUXdEZ1lEVlIwUEFRSC9CQVFEQWdXZ01CTUdBMVVkCkpRUU1NQW9HQ0NzR0FRVUZCd01DTUF3R0ExVWRFd0VCL3dRQ01BQXdId1lEVlIwakJCZ3dGb0FVTHc4c3lnYzUKM05jNUIrR2E2Z29Vd2tMK0lVSXdEUVlKS29aSWh2Y05BUUVMQlFBRGdnSUJBRktTOG1VRy9xU1RqYXZQWFFtZwpHdTdueUp3ODR5UHFrSXVnWUROeE5LRlVKaGRVdTJqZnUzQ1hPVThEZU1GaTlZQVl1WmlOZ0phdUJmbGZyQWE1Cm1rZzEzK2VxSlRxNVgxN01hWjk3a1dLSDdqd1I4NmdPd0lEZk5iQjhJRm5FaE5YVUJOTEFNRExQUUhPV3hldWYKQnJHQWk5Sy9hK0tHd2tkekZIT25wNGhPYWtnVWNnYStDTlNCN0hhV1I3cHl6MGR1ODVlSVN5SUlqTmVQN09HVApkaGFueDBzam53OWtabXFzUVdyNzVjRVdFVFdadlNJVGVCTEE1YTVsdVl0VDlFZXJ2bnl5OWVHUVNqSmw0S0ZoCmtWSy91Y3F1Ty83Ky9RUmpRNVVqZHJ5TGdLdHdSVXpWcmdRdUdBL3Zia09kSlB4ZTgwRWNobENXK3d6cnFRTlcKd0M0KzE5TXZ5WDFQL0VPN0lXMTU1bGNtcWtBZFNMbm15cHB6UThZVDg5NlZVZjRWdTE2NTRWdzNoTG9xTllzWgpQMXdaa1dOVHZKZ1Z2WFlxZ1NOSEZ6V2tyeDlMRGE1cGE0Mm45RWlaRXp2Z3ZUMlgwVE9qdTBHbjA2VHZFeFFjCjk4endtaWVUMStWdC9xTXFYYjZyZ0tkSTNjZ2k0Z2RZL1VnVVFDcEJ6NGtzdytWMzdGUHBENWthUnoreUZNSSsKbWZLUGEyUzQzRDFzVDZvYmtyUG5jQ2ZoWHZPczcrcEF4QUFrWWlpa3ZKT2lxQzVMeXBzalVRM2dTYkhJVDJOegpCY3ZEbjV2VHo3U3pvUHBuRllybjBRUU1wdU9rR3g1cUpnSFZNUW92aGpDKzNrK1VNRlBhbmZsL28yaTZ2dkIwCjMwVjBwOW5nMmFsTmZaWm9Xd1ZCQm5xdAotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
              - client_key             = "LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlKS1FJQkFBS0NBZ0VBMzRUMnh0bUhoWGdSb1VtNmNUZ1lOdnJSZkJYamwyR2NwbStMYVVNeEdZQWdHMEM2Cm9FdVFRbEZ0RWZaY0xtM0EzRXRKVlNBOHlrbkpZT1prdk1mV1RNdXdOOFk2R3NvcTVkNHA4amdnK3F5c0wxTksKQmVGOGw5VVR6eGFqa1JMMFF1UEJQUU13eGVZZEU3eGNIcUNVbTh4c2JQbTNDbmZnem5YMUU5eGllT2gxWXFPeApnbkpUV0lxKzRLYStjZVlUaU5pVzFWQUtRL0dvVXZRaXduSCtoYk9haDBZOFBXQzRKeU92YmNCSi9IdTZqaUNNCjdYMW0xQUZRazg0a0IycHAvMnBBaWhFS1YydGpwUktZZ1RpZzdVSDdBSUp2dG9pWUVxRDlQQU1ObUtlTERHNmYKYWFOWlhwL2drUnE3TzVvejJRYUdVc0w2aVErWGRHUDM2WFRtdDJZWW1mTGNBKy95MDI2UjNpUTlEZkwwV3J2Tgp2dFJJb0doOWNjYS9wbVlHUDA2U1NjWHhKanVsNE5NNHllWmQ5ZTE3NS9zRXlIeW1CcEVDaGRwVXNzMVZQQUdLCnh5VHpDVTBkVC9sSjZZQTNlNE9DVzNvMG44RkM2OEE5N3ZjSkRXQmEzME9JcEs0ZDBOUkVWRUVJbVVBeGxpYkgKWmt3YUVTWTkrenVwSDJYOTdISGhvQlRaY3FmeWNSTGx5ODF4dUVCb3NyblZ1STA3ai9VMWdOSEo0a0RpL2FrTQpkYmt4UDJKdUJlQjMwWTRwUW5xQ1d2cm1WQWZ5cHNtaFJrUm9ZR0EvZ2NibjFkdFpmUVcrNUdBZm42THgveWJXCm8vS1IxZmJMcWhxRnlQY1RFUEF3amc5T3JWbVk0K3RVckgyVHZiK1ROTmhZdjM0RG9FQXVJdXVWSUgwQ0F3RUEKQVFLQ0FnQjN3enVpb2kxdUF6NlhCL1VnOHVodWxRZW5qK2JwVnNEam9NSzIvT3lTK0VhN3Mzd0xwVkUvWjNlawpkemMvSFVtSC84TGtIS2pWenFGYkRUZU91eGlFLzJLRkQrNVVLbHkvMjhEbjZ0RW8zMXBHNVQ2MVZmTTNPMUVvCjFiMkFYd0tIMEpiYWhSb2QvMFUzTE9iQzlsR0tCUWRYZ0psbHY0T3h2Qnc3cndzSU02MnAwNEdxSG0ydjlHOS8KMlhnVGVTNmdWVVRFT09XM01BVjdwUm4yeTdPUG1nTkRWZ3V5NjE3Z2djdGVaL2g4a3lNTFFqK2doRitUV3J6OAo1U2dDM1M2OFR3Y1RzenV5U1hVVG5wb2VLdVIzRzdKTXZKYjAyODEzdGREWjFkejBIVmx3cU5rN2RlM051S1pQCnVWMzIrcEdyU0VheWs0dy80aDNKbkVMYVVPdkkraEw3dlpiczErNTlWOFhUT0tZQUR5czhvUDVVN3cxZUdVVTQKOTYzUEhzS2d5MG9ENDdvWjV2WFZBUWhheEY4UHdPSXg3NGZkMm9qQUVXWkxWOTdRcmJ0SHBoa05xTStMWWw1SAp0eVJidzEzTms2b1drd3F5Um82N0NlSm5XWHQ3RFpHUUZKNWQwUGR0MXJYbWpRT1dOOGZ3a1VkQnNvRVVpUEdjCnZMbWhMYUhUVVl2aFp6YUVjWXlmaFFIV0hyNnVqN015WCtoRUJyQWhDL1ZSS1EzcE9qdTAxc2x0Z1RmR09VYTYKVTBpYmFya1plL3FOVW01SmVYTjRRbDVrRStVeGFTL1podVgydzZUOHNxaDl6bXlYZjRnMlhsdjBsR01IZWU0SQoxVytZU1RSRGxxUDJ3Nlo1Q3NpT2sxRW9naitVbldSL0Y4d2l2K1dpZGczTlRNazlRUUtDQVFFQStjK2ZhcmFLCk5oajRvQWtjTXVPaDZQanJ3R3diTlB2UXZxM1pjV0ZjbXByVURTNEJhUHFpNmJPdlEyMVVuYzNNSDhSVmJDSGwKaFcyQlp3SlpCaldvQkRUbWNndS80UjZRZFdoNGx2RnBWZnZaMkREckVjcWFDc241cm1JWk5WNXBiaTQ2NS8wUwpZc1VMZC9FUkMxSGVBcmgvT1pzc1Z1byswT1EwVWZmR0lETXdkVEcvZUIxZ0NFQTNwb3MzUTR3NlpwRk13bVlmClNmYlVzRHdnbVB0VWx3bUluUFF2V3pIZnhZOVFMWUtYNnE4ZlkvZU11UTVwTnpkMExUQ3RJVncrVGNlN1JabXkKam1WUU1maUhvUWNQbEtKOGZkQnNBNGlnYzlqcGZZUnkwYm5nd0Roejc4QnJFNWZ1UTB4amk3TktTMG5rMGp3dwo0ZzQrZUlLbHVKUG0wUUtDQVFFQTVRNlhleS9HQ1BEK0FvY1MxVFQranhDa2Y2U1VXbis5aHhIMUM1czZ4NWdSCmRnV2paajVjcFBwRHBtWkRNMndrRHlmTkdmeThQSTRDYnNoR1ZEZnhJSUl1cWZLY2J2VkZFeGlNOUQ4ZnFqUUsKN2srNVlEZkVpdXVDUU9LcjdzWG8zbEY5YXlwRmdwZFN5c1MwbXJEdzhnQ1poaHhScnFlTERHRjB2NVRGZFpEQgpNbXBTR2FQM1ZBMGN4SVUvNXFVL09XWEZTWEN4VmZXeTc1b0lNL2tMOGcrSGNjZEc4L2NGMkxkMkppNmQ2RXRICjFLeDkrOFdJSHVuRlBFU3hTNE9ZOTZieUtWUkhZRUtxNktrSHA0SkNMZjhaU0JqUzZMdVJhQXp0S1QwcHVqU20KamN5S0U0KzJQd1hFd3RPR3JTaE9OVWhUS2ZMN3piWlZJaTFzREUraDdRS0NBUUVBcjdiYytXRGdvdUM1c1VmMwpMOHh5REw5YWhJVUdOaVNTVmkxTzc3TitRYmw2UXJNRGh1WVZSYkdBTER0dzgzYlloOWZBQmtscGVvcm1KS0RBCkllQUlDTDExQXU5RXpvS0ROakovOEJ4cTdYSXpieUFwbU9BYnJrOFhjeFBKaTRLWFFrcitZRVBnZE4wSkRocmcKMUVlSGsvNVdieHk0K1lIWElYUURZVXlaYmZqVHN2dUZKR1gxTUppTERIaU1MTlVzRncxSklzeFdZZDVmQ0graQpwampTN1ZKbFo1RlM1aUNVdUEvd1k3S2lUUTlWVXluRE1ELzB2a1FoVWRBVlY0dmN2elVvZ3ZKemFEblhTTzc1CjU4aGhxemtIdkMrb2Ftdm1BTmFvbGdOZUNDdG83WXhIOEhJMlh4ZlZIajFUSCtiQzhXWk9yNXBxLy9ibzlqZGYKZmc5Nm9RS0NBUUFvRk9HVkFNc2FqWEVsYUJWM2tZcHA1bk9pa2w0VFovNzJQOEl0Z2NCTFpPVEpUanRGak93UgpRbW5NR0dEeUFwNWN1STQvV2VabWdrTVN0NkQyNDhNaCtTWEpQMWI0WTVydXVJRVJ6R255RXFGSENsUlo3ZWhLCmx1TjREekllMmlyaG5FamlFOGVPRG9UQ1RxRjc0REtKWm1sMitrV2cxbGlTbGdzajZ4aVNkZjRZb0ZvMWVtZXgKSVlwREtUNEJVakU2RGdEejFQQnpKa2RsZmdLcGRZOE5rSUlXK3RRRHBObzFEZ1Z5c1AyWXhIT1JWNDNFSE5DdworQjgzYUozTnBQMkRlSWN2akR2aE1FbFA1U1FkdjhGczR4SzlkdnFSRnlGZW44UndUdSthVWRSRFErTjFnTlJYCk90OHZhR3hNcUp6bTNmMFBmaUZwNGRvTDNQN25PSmdSQW9JQkFRRDJKQUZ3dmhTSG54WTY3bFRoTmoweE01K04KNVBIRngzQUVXMWJXYTFhaC83ek9YQ2swcGNKVkVrRFQvMWszT3JZd0dPOTYzZENjZnhaZis2ejFQaEkwTVZIUgoyNnZUK3VpMWdzd1dvbHJUbFNGeXVLNzFZYUUycjExL25NdEk2QjM0UEJKdzFxQmVtVGVlV0YyUTFhZFp0ZlB1CnVaV0RHb2lYODYzN0R3anV3bndGdFM3SHp5Q0tvNXBrK081UTZHTWs3TUlmTUZBK21UdUdlV2huK3dMNVdlODkKTjNxaEQ0elM2cGtPVFU4TFkveXUvZ3Vhc1JVRW1oV0djMDZPcU0vYkZKd1NwQU1OVk1wdm1pUnFOazI5dHJYOAo3M1ZxUjVXZ2lNR2tIcCtOY0wxdGNDWGpaY0xkZkxrK24ySXN6bDVSVytkUDRYT2xtVDl5aGNoVUZHTmUKLS0tLS1FTkQgUlNBIFBSSVZBVEUgS0VZLS0tLS0K"
              - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUU2RENDQXRDZ0F3SUJBZ0lRVitDUnVyOHJkL3Bjc2N3SGxBMjdvVEFOQmdrcWhraUc5dzBCQVFzRkFEQU4KTVFzd0NRWURWUVFERXdKallUQWdGdzB5TWpBeU1URXdNelExTWpKYUdBOHlNRFV5TURJeE1UQXpOVFV5TWxvdwpEVEVMTUFrR0ExVUVBeE1DWTJFd2dnSWlNQTBHQ1NxR1NJYjNEUUVCQVFVQUE0SUNEd0F3Z2dJS0FvSUNBUURKCllUWTJYTUM0M1FzSWU3dWR2Zk1oQTZ1alhJbzRpMGIxaTgrMUVHQjR0OHU2SU9qK1VrSTdtcTVNKy9pZ2tWdUQKa3J4T0xMaFNkTUVOcTJFOUFoTDhka0IzUkNkWVFrRlU2cHpXbVRaS1BpMTcrY1VuN1hCV3FmMzlDUE5tSmQyWgpaY3NtV0w2bmtSWmRTMVdGWHBPN3dWQXBQSUlMS1picG0wUmxwZ1VtSzZZMVpqVHRGVE5mT3hrbGNUYnNkSVQ3CkJIVkhaQWFqM1JYbGpmSmp2UHlZWGg2eFA3bllEeU84Nis0cjFURFFZTWEvRTZ5N0hVWXYvNzkyVUU3UUY2Y2QKcXkvY1VDWTI1Wnc3Uno0WWtxd3I1THVjR21rSTdKR2JBcnBkZ1lPMitqZ3ZkT2RDR3RpeTd1UGJ2SXJuWmdWUQp5U0M3Y2swY0hiMnZHbnhuMGNBMXRLd2JRU0RKTHpOVHk1aTNhVHBWdXhYc1FpbTF6VnVWb3cxVnR3RjFickswCjRmUWRweW1aaVlwQlF0c0pzWnJTdnEyZWJKT0EyR2ZaQjVPU1V1TGMwMmlIcm9zYktURGQrRU5pRjRlNy84alMKTGxYR0Z3VHpKT1VGb1JaenpZTEYrcVBzMzZHS3NLM0xIMklvNFpGK0xiTXBCeCtWTjY2ZWJTaXNuLzdxZElpKwpNWEhwRmJwZGlGb3BEZTNqTExlVzhESWhlckhwK043YTdaVFdSVzdLMWdMNmJObktzbjN4Qm1yVG9EdGdsL0ttCnhpZjhaclUwNVhtSzl4RnNnQmxaY1o3L0o2MUhOTDh1clNHempPbFdaeWxjbE44VzROSGR2MDB1am80aFZLSXYKejZVUmVPem9TVkpQZ2xrOVhYV25XSTloYU0rVjRBZVJwMDBBb3ZVeXRRSURBUUFCbzBJd1FEQU9CZ05WSFE4QgpBZjhFQkFNQ0FxUXdEd1lEVlIwVEFRSC9CQVV3QXdFQi96QWRCZ05WSFE0RUZnUVVMdzhzeWdjNTNOYzVCK0dhCjZnb1V3a0wrSVVJd0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dJQkFGb1Y5aDFsclFKQmU0YjJaNmtuWmYvbHNxMXAKVjB3U3NnV04yY3NDeFFyKzlsajZiWkwxRENZYVpBdFhoK0NmUGpMcUVuSlRRSlJoNGtjdWJyc0R5WjlYb29OWQpSRzQ5Rkp3WUpKMDVIenR2cGRiekNYMUhKMEZuamxSZUZRZCtDS0ZmV2ZYV1VkNU15UTM4TkNuMy9pTUIwbDFtCjl5OWNDMzhRUkJZcENyejBCaFE3ZUpWNm1uZTBLQXV5VisxMkVORzZVVWp4NnA4L2R4WC9GdXFEU3RzY2RkOHQKSkhkY2ErZTROMVlQUm9oNWZQU3BIUUdiSkJIZU95elNTaGwyY1RzZGxHMnM0eWJsL3FCUHRXTXBJYkFtalhLVwoxZ1czYWw3dUIzUTRuOHU3SjhPNVMwMTg1RFE4dXNXV25YOFFxSWZiWkc4RVBMdmpXWklpV2FCaGZPd0l4SVQ2ClB5N2N3RU5oVkVudDhJdG1NZC9hYWdTSlRoN3FYTkJiN1RZLzdJTHcyMmw3dGlrWGExNWVlRjMyVzN6dktXWk8KQmdjRERBZlJaQW9abFdNNTFwMkQ2aDJiMXRJZTlZamN4bzM4SWdxZjZwK2l3amlyUTFtUjR5dVVGTFVzejFuVgpZdkE2V0crWW5uaWh0MU9CYVhyanhvTVNNeU5xMDFMS0NqQXN1LzhaWUV0UlBkOE8rSTBScVBxUmt2ei8yRkZtCmJibDM5TlhLNGIwL25NcDVrSzlaUWw0NFQrVUtMRjQxdHFXZ1NGSE1WZm5lTEVkazVNWllrNmxjTjc5eTE5TUoKbEFYNmUxM2tJMHRGZTRwd2Z0QlkyV1RyTXByVW9Ja050cjBpYTZrZHdrOS9OYUs4aDlaVk1KLzR4bTNsM3BXdApmUGhBbytkeCt1cHlKczBBCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
              - host                   = "https://tfq-liatrio-aks-dev-9b79eecd.hcp.eastus2.azmk8s.io:443"
              - password               = "97023798f31b0ce68fc353398d3b90e2f3a0e3c097f1b2a4ef83ce998f0157790e924da8cdef28d5cf34f7f1c67c29bb30ec5e5e8b8e08605060c02bde4d04d3"
              - username               = "clusterUser_liatrio-rg-dev_liatrio-aks-dev"
            },
        ] -> null
      - kube_config_raw                     = (sensitive value)
      - kubernetes_version                  = "1.21.7" -> null
      - local_account_disabled              = false -> null
      - location                            = "eastus2" -> null
      - name                                = "liatrio-aks-dev" -> null
      - node_resource_group                 = "MC_liatrio-rg-dev_liatrio-aks-dev_eastus2" -> null
      - portal_fqdn                         = "tfq-liatrio-aks-dev-9b79eecd.portal.hcp.eastus2.azmk8s.io" -> null
      - private_cluster_enabled             = false -> null
      - private_cluster_public_fqdn_enabled = false -> null
      - private_dns_zone_id                 = "" -> null
      - private_fqdn                        = "" -> null
      - private_link_enabled                = false -> null
      - public_network_access_enabled       = true -> null
      - resource_group_name                 = "liatrio-rg-dev" -> null
      - sku_tier                            = "Free" -> null

      - addon_profile {
          - aci_connector_linux {
              - enabled = false -> null
            }

          - azure_keyvault_secrets_provider {
              - enabled                 = false -> null
              - secret_identity         = [] -> null
              - secret_rotation_enabled = false -> null
            }

          - azure_policy {
              - enabled = false -> null
            }

          - http_application_routing {
              - enabled = false -> null
            }

          - ingress_application_gateway {
              - enabled                              = false -> null
              - ingress_application_gateway_identity = [] -> null
            }

          - kube_dashboard {
              - enabled = false -> null
            }

          - oms_agent {
              - enabled            = false -> null
              - oms_agent_identity = [] -> null
            }

          - open_service_mesh {
              - enabled = false -> null
            }
        }

      - default_node_pool {
          - enable_auto_scaling          = false -> null
          - enable_host_encryption       = false -> null
          - enable_node_public_ip        = false -> null
          - fips_enabled                 = false -> null
          - kubelet_disk_type            = "OS" -> null
          - max_count                    = 0 -> null
          - max_pods                     = 110 -> null
          - min_count                    = 0 -> null
          - name                         = "default" -> null
          - node_count                   = 1 -> null
          - node_labels                  = {} -> null
          - only_critical_addons_enabled = false -> null
          - orchestrator_version         = "1.21.7" -> null
          - os_disk_size_gb              = 128 -> null
          - os_disk_type                 = "Managed" -> null
          - os_sku                       = "Ubuntu" -> null
          - type                         = "VirtualMachineScaleSets" -> null
          - ultra_ssd_enabled            = false -> null
          - vm_size                      = "Standard_D2_v2" -> null
        }

      - network_profile {
          - dns_service_ip     = "10.0.0.10" -> null
          - docker_bridge_cidr = "172.17.0.1/16" -> null
          - load_balancer_sku  = "Standard" -> null
          - network_plugin     = "kubenet" -> null
          - outbound_type      = "loadBalancer" -> null
          - pod_cidr           = "10.244.0.0/16" -> null
          - service_cidr       = "10.0.0.0/16" -> null

          - load_balancer_profile {
              - effective_outbound_ips    = [
                  - "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/MC_liatrio-rg-dev_liatrio-aks-dev_eastus2/providers/Microsoft.Network/publicIPAddresses/235d4431-64c5-46db-a54e-b65cbee7c33a",
                ] -> null
              - idle_timeout_in_minutes   = 0 -> null
              - managed_outbound_ip_count = 1 -> null
              - outbound_ip_address_ids   = [] -> null
              - outbound_ip_prefix_ids    = [] -> null
              - outbound_ports_allocated  = 0 -> null
            }
        }

      - role_based_access_control {
          - enabled = true -> null
        }

      - service_principal {
          - client_id     = "9610f47c-08fb-4b94-ae1d-8ad2f8fb57e1" -> null
          - client_secret = (sensitive value)
        }
    }

  # azurerm_resource_group.default has been deleted
  - resource "azurerm_resource_group" "default" {
      - id       = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev" -> null
      - location = "eastus2" -> null
      - name     = "liatrio-rg-dev" -> null
    }

  # azurerm_role_assignment.aks_acr has been deleted
  - resource "azurerm_role_assignment" "aks_acr" {
      - id                   = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.ContainerRegistry/registries/liatrioacrdev/providers/Microsoft.Authorization/roleAssignments/aac180c9-fb21-17be-d34f-4d3a802d3642" -> null
      - name                 = "aac180c9-fb21-17be-d34f-4d3a802d3642" -> null
      - principal_id         = "05cd3ee5-0f0e-47a3-bf6f-990c94cd43e1" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> null
      - role_definition_name = "Reader" -> null
      - scope                = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.ContainerRegistry/registries/liatrioacrdev" -> null
    }

  # azurerm_role_assignment.aks_network has been deleted
  - resource "azurerm_role_assignment" "aks_network" {
      - id                   = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.Authorization/roleAssignments/5a276948-3131-70c0-b874-d208955e9b98" -> null
      - name                 = "5a276948-3131-70c0-b874-d208955e9b98" -> null
      - principal_id         = "05cd3ee5-0f0e-47a3-bf6f-990c94cd43e1" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/providers/Microsoft.Authorization/roleDefinitions/4d97b98b-1d4f-4787-a291-c67834d212e7" -> null
      - role_definition_name = "Network Contributor" -> null
      - scope                = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_registry.default will be created
  + resource "azurerm_container_registry" "default" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + georeplication_locations      = (known after apply)
      + georeplications               = (known after apply)
      + id                            = (known after apply)
      + location                      = "eastus2"
      + login_server                  = (known after apply)
      + name                          = "liatrioacrdev"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "liatrio-rg-dev"
      + retention_policy              = (known after apply)
      + sku                           = "Standard"
      + storage_account_id            = (known after apply)
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # azurerm_kubernetes_cluster.default will be created
  + resource "azurerm_kubernetes_cluster" "default" {
      + dns_prefix                          = "tfq-liatrio-aks-dev"
      + fqdn                                = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (known after apply)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (known after apply)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "eastus2"
      + name                                = "liatrio-aks-dev"
      + node_resource_group                 = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = (known after apply)
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + private_link_enabled                = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "liatrio-rg-dev"
      + sku_tier                            = "Free"

      + addon_profile {
          + aci_connector_linux {
              + enabled     = (known after apply)
              + subnet_name = (known after apply)
            }

          + azure_keyvault_secrets_provider {
              + enabled                  = (known after apply)
              + secret_identity          = (known after apply)
              + secret_rotation_enabled  = (known after apply)
              + secret_rotation_interval = (known after apply)
            }

          + azure_policy {
              + enabled = (known after apply)
            }

          + http_application_routing {
              + enabled                            = (known after apply)
              + http_application_routing_zone_name = (known after apply)
            }

          + ingress_application_gateway {
              + effective_gateway_id                 = (known after apply)
              + enabled                              = (known after apply)
              + gateway_id                           = (known after apply)
              + gateway_name                         = (known after apply)
              + ingress_application_gateway_identity = (known after apply)
              + subnet_cidr                          = (known after apply)
              + subnet_id                            = (known after apply)
            }

          + kube_dashboard {
              + enabled = (known after apply)
            }

          + oms_agent {
              + enabled                    = (known after apply)
              + log_analytics_workspace_id = (known after apply)
              + oms_agent_identity         = (known after apply)
            }

          + open_service_mesh {
              + enabled = (known after apply)
            }
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + empty_bulk_delete_max            = (known after apply)
          + expander                         = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + max_node_provisioning_time       = (known after apply)
          + max_unready_nodes                = (known after apply)
          + max_unready_percentage           = (known after apply)
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
          + skip_nodes_with_local_storage    = (known after apply)
          + skip_nodes_with_system_pods      = (known after apply)
        }

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "default"
          + node_count           = 1
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_D2_v2"
        }

      + kubelet_identity {
          + client_id                 = (known after apply)
          + object_id                 = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + load_balancer_sku  = (known after apply)
          + network_mode       = (known after apply)
          + network_plugin     = (known after apply)
          + network_policy     = (known after apply)
          + outbound_type      = (known after apply)
          + pod_cidr           = (known after apply)
          + service_cidr       = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
              + outbound_ports_allocated  = (known after apply)
            }

          + nat_gateway_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
            }
        }

      + role_based_access_control {
          + enabled = true
        }

      + service_principal {
          + client_id     = "9610f47c-08fb-4b94-ae1d-8ad2f8fb57e1"
          + client_secret = (sensitive value)
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
          + license        = (known after apply)
        }
    }

  # azurerm_resource_group.default will be created
  + resource "azurerm_resource_group" "default" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "liatrio-rg-dev"
    }

  # azurerm_role_assignment.aks_acr will be created
  + resource "azurerm_role_assignment" "aks_acr" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "05cd3ee5-0f0e-47a3-bf6f-990c94cd43e1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.ContainerRegistry/registries/liatrioacrdev"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.aks_network will be created
  + resource "azurerm_role_assignment" "aks_network" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "05cd3ee5-0f0e-47a3-bf6f-990c94cd43e1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @husseinsa, Action: `pull_request`*